Reports/лб_РасшифровкаРасчетовПоЛС1.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>лб_РасшифровкаРасчетовПоЛС1</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонИзвещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ШаблоныИзвещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/бит_КонтактнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КонтактнаяИнформация</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле4</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле5</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле6</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле7</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле9</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле10</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоУмолчанию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДома</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыДомов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКорпуса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКорпусов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьТипыКвартир</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПользовательЛичногоКонтакта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ОрганыФМС</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыКонтактнойИнформации</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияОКвартире.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияОКвартире</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МОП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтапливаемаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СовокупнаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКвартиры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыКвартиры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыПлиты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапирающегоУстройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТипыЗапирающихУстройств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЖилоеПомещениеСпециализированногоЖилищногоФонда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИЭлектроснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлощадьОДНСОИВодоснаб</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВысотаПотолков</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПредставлениеКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьСальдоСвоихУслуг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_НеВыводитьСтрокуДомофон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ПлощадьКапремонта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Квартира</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Квартиры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ЗависимыеЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ЗависимыеЛС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчетЗависимый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/бит_СведенияПоУслугамЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СведенияПоУслугамЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимПотребления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РежимыПотребленияУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПоставщикиУслуг</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СпособыРасчетаПоУслугам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоЕдиницПотребления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачислениеПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачислениеПениПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаПени</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Reports/лб_РасшифровкаРасчетовПоЛС1/Ext/ObjectModule.bsl
перем мОтладка;



Функция РасшифровкаПоЛицевомуСчету(ЛС,ДляЗависимых=ложь,ТолькоПоследнийМесяц = ложь) экспорт
	
	Если ДляЗависимых = истина тогда
		СводныйТабДок = новый ТабличныйДокумент;
		ЗависимыеЛС = СписокЗависимыхЛС(ЛС);
		ВыводитьРазделитель = ложь;
		Для каждого ЛС1 из ЗависимыеЛС цикл
			Если ВыводитьРазделитель тогда
				СводныйТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;	
			ТабДок = РасшифровкаПоЛицевомуСчету(ЛС1,ложь);
			СводныйТабДок.Вывести(ТабДок);
			ВыводитьРазделитель = Истина;
		КонецЦикла;	
		возврат СводныйТабДок;
	КонецЕсли;	
	
	
	
	
	//Данные -  за весь период раздельно по основному и по зависимым
	
	ЗависимыеЛС  = СписокЗависимыхЛС(ЛС);
	
	 	
	ТаблСуммыЛС= СуммыДляОтчета(ЛС,ЗависимыеЛС,ЭтотОбъект.ДатаНач,ЭтотОбъект.ДатаКон);
	
	
	ТаблСуммыПениЛС = СуммыПениДляОтчета(ЛС,ЭтотОбъект.ДатаНач,ЭтотОбъект.ДатаКон);
	ТаблПараметрыЛС = ПараметрыЛС(ЛС,ЭтотОбъект.ДатаНач,ЭтотОбъект.ДатаКон);
	ТаблРасшОплат = ДанныеРасшифровкиОплат(ЛС);
	ТаблРасшРазовых = ДанныеРасшифровкиРазовых(ЛС);
	
	
    ТаблКолонок = ПолучитьКолонкиОтчета(ЛС,ЗависимыеЛС,ТаблСуммыЛС,ТаблСуммыПениЛС);

	НачалоМесяцаКон = НачалоМесяца(ЭтотОбъект.ДатаКон);
	//ТаблСуммыЗависимых = СуммыДляОтчета(ЗависимыеЛС,НачалоМесяцаКон,ЭтотОбъект.ДатаКон);
	ТаблПараметровЛС = ПараметрыЛС(ЗависимыеЛС,ЭтотОбъект.ДатаНач,ЭтотОбъект.ДатаКон);
	
		
	                                                                                                       		
	//ДобавитьКолонкиОтчета(КолонкиОтчета,ЛС,ТаблСуммыЛС);
	//ДобавитьКолонкиОтчета(КолонкиОтчета,ЗависимыеЛС,ТаблСуммыЗависимых);
	
	ТабДок = новый ТабличныйДокумент;

 	ОбластиМакета = СтруктураОбластейМакета();

	ВывестиЗаголовокОтчетаЛС(ТабДок,ЛС,ОбластиМакета) ;                                            
	ТекМес = ?(ТолькоПоследнийМесяц,НачалоМесяца(ЭтотОбъект.ДатаКон),НачалоМесяца(ЭтотОбъект.ДатаНач));
	Пока ТекМес<=ЭтотОбъект.ДатаКон цикл
		ВывестиБлокРасшифровки(ТабДок,ЛС,ТекМес,ОбластиМакета,ТаблКолонок,ТаблПараметровЛС,ТаблСуммыЛС,ТаблСуммыПениЛС,
								ТаблРасшРазовых,ТаблРасшОплат);
		ТекМес = ДобавитьМесяц(ТекМес,1);						
	КонецЦикла;		
	
	
	Для каждого ЛС1 из ЗависимыеЛС цикл
		ВывестиПримечаниеЗависимого(ТабДок,ЛС1,ОбластиМакета);
		ТабДок1 = РасшифровкаПоЛицевомуСчету(ЛС1,ложь,истина);
		ТабДок.Вывести(ТабДок1);
	КонецЦикла;	
	
	
	возврат ТабДок
КонецФункции	

Процедура ВывестиПримечаниеЗависимого(ТабДок,ЛС1,ОбластиМакета);
	Область = ОбластиМакета.ПримЗависимого;
	Область.Параметры.ЛС = ЛС1;
	Табдок.Вывести(Область);
КонецПроцедуры 

Процедура ВывестиЗаголовокОтчетаЛС(ТабДок,ЛС,ОбластиМакета)
	Если ложь тогда ЛС = Справочники.бит_ЛицевыеСчета.Выбрать().Ссылка КонецЕсли;
	АдресЛС = лб_Адрес(ЛС.Квартира);
	Область = ОбластиМакета.Шапка;
	Область.Параметры.НомерЛС    = ЛС;
	Область.Параметры.ЛС = ЛС;
	Область.Параметры.Адрес = АдресЛС;
	Область.Параметры.Район = ЛС.Здание.Район;
	ТабДок.Вывести(Область);
КонецПроцедуры	


Функция лб_Адрес(Квартира,Сокращенный=истина,Дата=неопределено) экспорт
	Если ложь тогда Квартира = Справочники.бит_Квартиры.Выбрать().Ссылка КонецЕсли;
	Дом = Квартира.Владелец;
	
	Если Сокращенный = истина тогда
		АдресДома = ""+Дом.Улица + ", д."+Дом.НомерДома+Дом.ПрефиксДома;
	Иначе
		ВидКИ = Справочники.бит_ВидыКонтактнойИнформации.ПочтовыйАдресЗдания;
		ТипКИ = Перечисления.бит_ТипыКонтактнойИнформации.Адрес;
		ЗАпрос = новый запрос;
		Запрос.УстановитьПараметр("Вид",ВидКИ);
		Запрос.УстановитьПараметр("Тип",ТипКИ);
		ЗАпрос.УстановитьПараметр("Объект",Дом);
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_КонтактнаяИнформация.Представление
			|ИЗ
			|	РегистрСведений.бит_КонтактнаяИнформация КАК бит_КонтактнаяИнформация
			|ГДЕ
			|	бит_КонтактнаяИнформация.Объект = &Объект
			|	И бит_КонтактнаяИнформация.Тип = &Тип
			|	И бит_КонтактнаяИнформация.Вид = &Вид";
		Выборка = ЗАпрос.Выполнить().Выбрать();
		Если Выборка.Следующий() тогда
			АдресДома = Выборка.Представление;
		иначеЕсли Не ПустаяСтрока(Дом.ПочтовыйАдрес) тогда
			АдресДома = Дом.ПочтовыйАдрес; 
		иначе	
			АдресДома = "*** Почтовый адрес дома "+ Дом.Код + " не заполнен ***";
		КонецЕсли;
	КонецЕсли;
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("Квартира",Квартира);
	ЗАпрос.УстановитьПараметр("Дата",Дата);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_СведенияОКвартиреСрезПоследних.лб_ПредставлениеКвартиры КАК ПредставлениеКвартиры
		|ИЗ
		|	РегистрСведений.бит_СведенияОКвартире.СрезПоследних(&Дата, Квартира = &Квартира) КАК бит_СведенияОКвартиреСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и НЕ ПустаяСтрока(Выборка.ПредставлениеКвартиры) тогда
		ПервыйСимволПредставления = лев(Выборка.ПредставлениеКвартиры,1);
		пр1 = ?(СтрНайти("0123456789",ПервыйСимволПредставления)>0,"кв.",""); 
		Адрес = АдресДома + ", "+пр1+ Выборка.ПредставлениеКвартиры;
	иначе
		Адрес = АдресДома + ", кв."+Квартира.НомерКвартиры + Квартира.ПрефиксКвартиры
	КонецЕсли;	
		
	возврат Адрес	
КонецФункции

Процедура ВывестиБлокРасшифровки(ТабДок,ЛС,ТекМес,ОбластиМакета,ТаблКолонок,ТаблПараметровЛС,ТаблСуммыЛС,
									ТаблСуммыПениЛС,ТаблРасшРазовых,ТаблРасшОплат);
	СообщитьОтладка("ВывестиБлокРасшифровки" + " ЛС=" + ЛС + " ТекМес="+ТекМес);							
								
								
КонецПроцедуры

Функция СтруктураОбластейМакета()
	Макет = ЭтотОбъект.ПолучитьМакет("Макет");
	
	
	Области = новый структура;
	
    Области.Вставить("НазванияУслуг_Лев"	, Макет.ПолучитьОбласть("НазванияУслуг|Лев"));
	Области.Вставить("НазванияУслуг_Услуга" , Макет.ПолучитьОбласть("НазванияУслуг|Услуга"));
	Области.Вставить("НазванияУслуг_Пени"   , Макет.ПолучитьОбласть("НазванияУслуг|Пени"));
	Области.Вставить("НМОО_Лев"     , Макет.ПолучитьОбласть("НМООО|Лев"));
	Области.Вставить("НМООО_Услуга" , Макет.ПолучитьОбласть("НМООО|Услуга"));
	Области.Вставить("НМООО_Пени"   , Макет.ПолучитьОбласть("НМООО|Пени"));
	Области.Вставить("НМ_Лев"       , Макет.ПолучитьОбласть("НМ|Лев"));
	Области.Вставить("НМ_Услуга"	, Макет.ПолучитьОбласть("НМ|Услуга"));
	Области.Вставить("НМ_Пени"   	, Макет.ПолучитьОбласть("НМ|Пени"));
	Области.Вставить("Нач1_Лев"     , Макет.ПолучитьОбласть("Нач1|Лев"));
	Области.Вставить("Нач1_Услуга" 	, Макет.ПолучитьОбласть("Нач1|Услуга"));
	Области.Вставить("Нач1_Пени"   	, Макет.ПолучитьОбласть("Нач1|Пени"));
	Области.Вставить("Раз1_Лев"     , Макет.ПолучитьОбласть("Раз1|Лев"));
	Области.Вставить("Раз1_Услуга" 	, Макет.ПолучитьОбласть("Раз1|Услуга"));
	Области.Вставить("Раз1_Пени"   	, Макет.ПолучитьОбласть("Раз1|Пени"));
	Области.Вставить("Опл1_Лев"     , Макет.ПолучитьОбласть("Опл1|Лев"));
	Области.Вставить("Опл1_Услуга" 	, Макет.ПолучитьОбласть("Опл1|Услуга"));
	Области.Вставить("Опл1_Пени"   	, Макет.ПолучитьОбласть("Опл1|Пени"));
	Области.Вставить("КМ_Лев"       , Макет.ПолучитьОбласть("КМ|Лев"));
	Области.Вставить("КМ_Услуга" 	, Макет.ПолучитьОбласть("КМ|Услуга"));
	Области.Вставить("КМ_Пени"   	, Макет.ПолучитьОбласть("КМ|Пени"));
	Области.Вставить("Пустая_Лев"   , Макет.ПолучитьОбласть("Пустая|Лев"));
	Области.Вставить("Пустая_Услуга", Макет.ПолучитьОбласть("Пустая|Услуга"));
	Области.Вставить("Пустая_Пени"  , Макет.ПолучитьОбласть("Пустая|Пени"));
	
	Области.Вставить("ИтогоСРЖ"	, Макет.ПолучитьОбласть("ИтогоСРЖ"));
	Области.Вставить("Шапка"    , Макет.ПолучитьОбласть("Шапка"));
	Области.Вставить("ШапкаБл1" , Макет.ПолучитьОбласть("ШапкаБл1"));
	Области.Вставить("ШапкаБл2" , Макет.ПолучитьОбласть("ШапкаБл2"));
	Области.Вставить("ПримЗависимого", Макет.ПолучитьОбласть("ПримЗависимого"));
	
	возврат Области;
КонецФункции	

Функция ПараметрыЛС(ЛС,Дата1,Дата2)
КонецФункции	

Функция ДанныеРасшифровкиОплат(ЛС);
КонецФункции

Функция ДанныеРасшифровкиРазовых(ЛС);
КонецФункции

Функция ПолучитьКолонкиОтчета(ЛС,СписокЛС,ТаблСумм,ТаблПени)
КонецФункции	

Функция СписокЗависимыхЛС(ЛС)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ЛС",ЛС);
	Запрос.Текст =
		 "ВЫБРАТЬ
		 |	бит_ЗависимыеЛС.ЛицевойСчетЗависимый КАК ЛС1
		 |ИЗ
		 |	РегистрСведений.бит_ЗависимыеЛС КАК бит_ЗависимыеЛС
		 |ГДЕ
		 |	бит_ЗависимыеЛС.ЛицевойСчет = &ЛС";
	СписокЛС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЛС1");
	возврат СписокЛС;
КонецФункции	





Функция СуммыДляОтчета(ЛС,ЗависимыеЛС,Дата1,Дата2)
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокЛС",ЗависимыеЛС);
	Запрос.УстановитьПараметр("ЛС",ЛС);
	Запрос.УстановитьПараметр("Дата1",Дата1);
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	Запрос.УстановитьПараметр("ВозвратОплаты",Перечисления.бит_ВидыОперацийРазовыеПоЖКХ.ВозвратОплаты);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.Месяц КАК Месяц,
		|	ВложенныйЗапрос.УслугаЖКХ КАК УслугаЖКХ,
		|	СУММА(ВложенныйЗапрос.СуммаНМООО) КАК СуммаНМООО,
		|	СУММА(ВложенныйЗапрос.СуммаНМ) КАК СуммаНМ,
		|	СУММА(ВложенныйЗапрос.СуммаКМ) КАК СуммаКМ,
		|	СУММА(ВложенныйЗапрос.СуммаНач) КАК СуммаНач,
		|	СУММА(ВложенныйЗапрос.СуммаИзм) КАК СуммаИзм,
		|	СУММА(ВложенныйЗапрос.СуммаОпл) КАК СуммаОпл
		|ИЗ
		|	(ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СуммыОстООО.Период, МЕСЯЦ) КАК Месяц,
		|		СуммыОстООО.УслугаЖКХ КАК УслугаЖКХ,
		|		СуммыОстООО.СуммаНачальныйОстаток КАК СуммаНМООО,
		|		0 КАК СуммаНМ,
		|		0 КАК СуммаКМ,
		|		0 КАК СуммаНач,
		|		0 КАК СуммаИзм,
		|		0 КАК СуммаОпл
		|	ИЗ
		|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&Дата1, &Дата2, Месяц, , ЛицевойСчет В (&СписокЛС)) КАК СуммыОстООО
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СуммыОст.Период, МЕСЯЦ),
		|		СуммыОст.УслугаЖКХ,
		|		0,
		|		СуммыОст.СуммаНачальныйОстаток,
		|		СуммыОст.СуммаКонечныйОстаток,
		|		0,
		|		0,
		|		0
		|	ИЗ
		|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.ОстаткиИОбороты(&Дата1, &Дата2, Месяц, , ЛицевойСчет В (&ЛС)) КАК СуммыОст
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СуммыНач.Месяц,
		|		СуммыНач.УслугаЖКХ,
		|		0,
		|		0,
		|		0,
		|		СуммыНач.Нач,
		|		0,
		|		0
		|	ИЗ
		|		(ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК Месяц,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот КАК Нач
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Дата1, &Дата2, Регистратор, ЛицевойСчет В (&ЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		ГДЕ
		|			бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачислениеПоЛицевымСчетам
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Дата1, &Дата2, Регистратор, ЛицевойСчет В (&ЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		ГДЕ
		|			бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикам
		|		
		|		ОБЪЕДИНИТЬ ВСЕ
		|		
		|		ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ),
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ,
		|			бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Дата1, &Дата2, Регистратор, ЛицевойСчет В (&ЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		ГДЕ
		|			бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_НачисленияПоСчетчикамГрупповыеСИндивидуальными) КАК СуммыНач
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		СуммыИзм.Месяц,
		|		СуммыИзм.УслугаЖКХ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		ВЫБОР
		|			КОГДА СуммыИзм.ЭтоОплата
		|				ТОГДА 0
		|			ИНАЧЕ СуммыИзм.Сумма
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА СуммыИзм.ЭтоОплата
		|				ТОГДА -СуммыИзм.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ
		|	ИЗ
		|		(ВЫБРАТЬ
		|			НАЧАЛОПЕРИОДА(бит_НачисленияПоУслугамЖКХОбороты.Период, МЕСЯЦ) КАК Месяц,
		|			бит_НачисленияПоУслугамЖКХОбороты.УслугаЖКХ КАК УслугаЖКХ,
		|			бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот КАК Сумма,
		|			ВЫБОР
		|				КОГДА ВЫРАЗИТЬ(бит_НачисленияПоУслугамЖКХОбороты.Регистратор КАК Документ.бит_РазовыеПоУслугамЖКХ).ВидОперации = &ВозвратОплаты
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ КАК ЭтоОплата
		|		ИЗ
		|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Дата1, &Дата2, Регистратор, ЛицевойСчет В (&ЛС)) КАК бит_НачисленияПоУслугамЖКХОбороты
		|		ГДЕ
		|			бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ) КАК СуммыИзм
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		НАЧАЛОПЕРИОДА(СуммыОпл.Период, МЕСЯЦ),
		|		СуммыОпл.УслугаЖКХ,
		|		0,
		|		0,
		|		0,
		|		0,
		|		0,
		|		-СуммыОпл.СуммаОборот
		|	ИЗ
		|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(&Дата1, &Дата2, Регистратор, ЛицевойСчет В (&ЛС)) КАК СуммыОпл
		|	ГДЕ
		|		СуммыОпл.Регистратор ССЫЛКА Документ.бит_ОплатаКУ) КАК ВложенныйЗапрос
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.УслугаЖКХ,
		|	ВложенныйЗапрос.Месяц";
	
	Табл = Запрос.Выполнить().Выгрузить();
	Табл.Индексы.Добавить("Месяц,УслугаЖКХ");
	
	
КонецФункции	

Функция СуммыПениДляОтчета(СписокЛС,Дата1,Дата2)
	
КонецФункции	


Функция ТаблКолонок(ЛС,ЗависимыеЛС);
	
	
	
	СписокУслуг = новый массив;
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("ОбщийСписокУслуг",лб_Сервер.лб_ПолучитьСписокУслугИзШаблонаИзвещения(ЭтотОбъект.ШаблонИзвещения));
	Запрос.УстановитьПараметр("УслугиСРЖОДН",лб_Сервер.УслугиСодержаниеРемонтОДН());
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЗ.Услуга КАК Услуга
		|ИЗ
		|	(ВЫБРАТЬ
		|		бит_СведенияПоУслугамЛССрезПоследних.Услуга КАК Услуга
		|	ИЗ
		|		РегистрСведений.бит_СведенияПоУслугамЛС.СрезПоследних(&Дата, ЛицевойСчет В (&СписокЛС,&ЛС)) КАК бит_СведенияПоУслугамЛССрезПоследних
		|	ГДЕ
		|		НЕ бит_СведенияПоУслугамЛССрезПоследних.РежимПотребления В (&НеНачислять, &Нет)
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ
		|	ИЗ
		|		РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&Дата1, &Дата2, , , ЛицевойСчет В (&СписокЛС,&ЛС)) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		бит_УслугиЖКХ.Ссылка
		|	ИЗ
		|		Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|	ГДЕ
		|		бит_УслугиЖКХ.Ссылка В(&СписокУслуг)) КАК ВЗ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЗ.Услуга";
	
	ТекМес = НачалоМесяца(ЭтотОбъект.ДатаНач);
	СписокЛС = новый массив;			
	Пока ТекМес<=ЭтотОбъект.ДатаКон цикл
		Если ТекМес =НачалоМесяца(ЭтотОбъект.ДатаКон) тогда
			СписокЛС = ЗависимыеЛС;
		КонецЕсли;	
		Запрос.УстановитьПараметр("Дата1",ТекМес);
		Запрос.УстановитьПараметр("Дата2",КонецМесяца(ТекМес));
		Запрос.УстановитьПараметр("ЛС",ЛС);
		Запрос.УстановитьПараметр("СписокЛС",СписокЛС);
		Запрос.УстановитьПараметр("СписокУслуг",СписокУслуг);
		
		СписокУслуг = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Услуга");
				
		ТекМес = ДобавитьМесяц(ТекМес,1);
	КонецЦикла;	
		
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("СписокУслуг",СписокУслуг);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Ссылка,
		|	бит_УслугиЖКХ.Приоритет КАК Приоритет,
		|	бит_УслугиЖКХ.НаименованиеСокращенное КАК НаимКолонки,
		|	бит_УслугиЖКХ.ГруппаУслуги КАК ГруппаУслуги,
		|	ЛОЖЬ КАК ЭтоПени
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	ТаблКолонок = Запрос.Выполнить().Выгрузить();
	
    //Добавляем колонки пени
	//Для СРЖ+ОДН - общая, после последней из колонок СРЖ и ОДН, выводится всегда
	//для остальных - после соотв. услуги, если есть пени по этой услуге
	
	//реализация - пени по услуге СРЖ содержит все и выводится в эту колонку
	УслугаСРЖ = лб_Сервер.УслугаСодержаниеРемонт();
	УслугиСРЖОДН= лб_Сервер.УслугиСодержаниеРемонтОДН();
	
	КрайняяКолонкаОДН = 0;
	Для инд=0 по ТаблКолонок.Количество()-1 цикл 		
		Если УслугиСРЖОДН.Найти(ТаблКолонок[инд])<>Неопределено тогда
			КрайняяКолонкаОДН=инд+1;
		КонецЕсли;	
	КонецЦикла;	
		
	Если КрайняяКолонкаОДН = ТаблКолонок.Количество() тогда
		КолонкаПени = ТаблКолонок.Добавить();
	ИначеЕсли КрайняяКолонкаОДН>0 тогда	
		КолонкаПени = ТаблКолонок.Вставить(КрайняяКолонкаОДН)
	КонецЕсли;;
	
	
	Запрос = новый запрос;
	Запрос.УстановитьПараметр("УслугиОДН",УслугиСРЖОДН);
	Запрос.УстановитьПараметр("СписокЛС",ЗависимыеЛС);
	Запрос.УстановитьПараметр("ЛС",ЛС);
	Запрос.УстановитьПараметр("Дата1",ЭтотОбъект.ДатаНач);
	Запрос.УстановитьПараметр("Дата2",КонецДня(ЭтотОбъект.ДатаКон));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ КАК УслугаЖКХ
		|ИЗ
		|	РегистрНакопления.бит_НачислениеПениПоУслугамЖКХ.ОстаткиИОбороты(&Дата1, &Дата2, , , ЛицевойСчет В (&СписокЛС,&ЛС)) КАК бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты
		|ГДЕ
		|	НЕ бит_НачислениеПениПоУслугамЖКХОстаткиИОбороты.УслугаЖКХ В (&УслугиОДН)";
	СписокПени = Запрос.Выполнить().Выгрузить();
	
	
		
		
	
	
	
	
	
	
	
	
	
	
	//КолонкиОтчета.Колонки.Добавить("Приоритет",Новый ОписаниеТипов("Число"));
	//КолонкиОтчета.Колонки.Добавить("ИмяКолонки", Новый ОписаниеТипов("Строка"));
	//возврат КолонкиОтчета
КонецФункции




Процедура ДобавитьКолонкиОтчета(КолонкиОтчета,СписокЛС,ТаблСуммЛС)
	
	
КонецПроцедуры	


Процедура СообщитьОтладка(Текст)
	Если мОтладка = истина тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Текст);
	КонецЕсли;	
КонецПроцедуры	
мОтладка = истина;
